In [1]:
import pandas as pd

In [2]:
data = {
    'Student ID': ['1', '2', '3', '4'],
    'Art': [3,4,5,4],
    'Math': [3,4,5,3],
    'Science': [5,4,3,4]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df.columns.names = ['Subject']

In [5]:
melted_df = df.melt(id_vars='Student ID',
                   var_name='Subject',
                   value_vars=['Art', 'Math', 'Science'],
                   value_name='Score')

In [6]:
melted_df

   Student ID  Subject  Score
0           1      Art      3
1           2      Art      4
2           3      Art      5
3           4      Art      4
4           1     Math      3
5           2     Math      4
6           3     Math      5
7           4     Math      3
8           1  Science      5
9           2  Science      4
10          3  Science      3
11          4  Science      4

In [ ]:
"